halfoffive/smart-flower-pot/esp32/smart_flower_pot/smart_flower_pot.ino
// 服务器回调：监听 BLE 连接与断开事件
class ServerCallbacks : public BLEServerCallbacks {
  void onConnect(BLEServer *pServer) override {
    deviceConnected = true;
    Serial.println("[BLE] ✓ 客户端已连接");
  }

  void onDisconnect(BLEServer *pServer) override {
    deviceConnected = false;
    Serial.println("[BLE] ✗ 客户端已断开，重新开始广播");
  }
};
#endif

/* ===================== 设置序列化 / 反序列化 ===================== */

// 将当前设置编码为 11 字节，发送给网页端
// 字节布局:
//   [0-1]  温度下限 uint16 (little-endian, ×10)
//   [2-3]  温度上限 uint16 (×10)
//   [4]    湿度下限 uint8
//   [5]    湿度上限 uint8
//   [6-7]  土壤阈值 uint16
//   [8]    比较模式 uint8 (0=低于, 1=高于)
//   [9]    水泵转速 uint8 (0-255)
//   [10]   浇水方向 uint8 (0=正转, 1=反转)
void serializeSettings(uint8_t *buffer) {
  buffer[0] = tempMin & 0xFF;
  buffer[1] = (tempMin >> 8) & 0xFF;
  buffer[2] = tempMax & 0xFF;
  buffer[3] = (tempMax >> 8) & 0xFF;
  buffer[4] = humMin;
  buffer[5] = humMax;
  buffer[6] = soilThreshold & 0xFF;
  buffer[7] = (soilThreshold >> 8) & 0xFF;
  buffer[8] = compareMode;
  buffer[9] = pumpSpeed;
  buffer[10] = waterDirection;
}

// 从网页端发来的 11 字节解码设置并应用
void deserializeSettings(uint8_t *buffer) {
  tempMin = buffer[0] | (buffer[1] << 8);
  tempMax = buffer[2] | (buffer[3] << 8);
  humMin = buffer[4];
  humMax = buffer[5];
  soilThreshold = buffer[6] | (buffer[7] << 8);
  compareMode = buffer[8];
  pumpSpeed = buffer[9];
  waterDirection = buffer[10];

  Serial.println("[设置] ─── 已更新 ───");
  Serial.printf("  温度区间: %.1f°C ~ %.1f°C\n", tempMin / 10.0, tempMax / 10.0);
  Serial.printf("  湿度区间: %d%% ~ %d%%\n", humMin, humMax);
  Serial.printf("  土壤阈值: %d (模式: %s)\n", soilThreshold,
                compareMode == MODE_BELOW ? "低于阈值启动" : "高于阈值启动");
  Serial.printf("  水泵转速: %d / 255\n", pumpSpeed);
  Serial.printf("  浇水方向: %s\n", waterDirection == 0 ? "正转" : "反转");
}

// 将传感器数据编码为 6 字节，推送给网页端
// 字节布局:
//   [0-1]  土壤 ADC 值 uint16
//   [2-3]  温度 uint16 (×10)
//   [4]    湿度 uint8 (%)
//   [5]    水泵状态 uint8 (0=停止, 1=正转, 2=反转)
void serializeSensorData(uint8_t *buffer) {
  buffer[0] = currentSoil & 0xFF;
  buffer[1] = (currentSoil >> 8) & 0xFF;
  buffer[2] = currentTemp & 0xFF;
  buffer[3] = (currentTemp >> 8) & 0xFF;
  buffer[4] = currentHum;
  buffer[5] = (uint8_t)pumpState;
}

/* ===================== 设置持久化（NVS 闪存） ===================== */

// 上电时从 NVS 加载设置，若无则使用默认值
void loadSettings() {
  prefs.begin(NVS_NS, false);

  tempMin = prefs.getUShort(KEY_TEMP_MIN, DEFAULT_TEMP_MIN);
  tempMax = prefs.getUShort(KEY_TEMP_MAX, DEFAULT_TEMP_MAX);
  humMin = prefs.getUChar(KEY_HUM_MIN, DEFAULT_HUM_MIN);
  humMax = prefs.getUChar(KEY_HUM_MAX, DEFAULT_HUM_MAX);
  soilThreshold = prefs.getUShort(KEY_SOIL_THR, DEFAULT_SOIL_THR);
  compareMode = prefs.getUChar(KEY_CMP_MODE, DEFAULT_COMPARE_MODE);
  pumpSpeed = prefs.getUChar(KEY_PUMP_SPEED, DEFAULT_PUMP_SPEED);
  waterDirection = prefs.getUChar(KEY_WATER_DIR, DEFAULT_WATER_DIR);

  // 校验浇水方向：仅允许 0(正转) 或 1(反转)
  // 旧固件可能将 0xFF（仅保存标志）写入 NVS，导致水泵始终反转
  if (waterDirection > 1) {
    Serial.printf("[NVS] ⚠ 浇水方向值异常: %d，已重置为正转(0)\n", waterDirection);
    waterDirection = DEFAULT_WATER_DIR;
  }

  prefs.end();

  Serial.println("[NVS] 设置已从闪存加载:");
  Serial.printf("  温度: %.1f ~ %.1f°C\n", tempMin / 10.0, tempMax / 10.0);
  Serial.printf("  湿度: %d ~ %d%%\n", humMin, humMax);
  Serial.printf("  土壤阈值: %d (模式: %s)\n", soilThreshold,
                compareMode == MODE_BELOW ? "低于启动" : "高于启动");
  Serial.printf("  水泵转速: %d\n", pumpSpeed);
  Serial.printf("  浇水方向: %s\n", waterDirection == 0 ? "正转" : "反转");
}

// 设置变更后保存到 NVS
void saveSettings() {
  prefs.begin(NVS_NS, false);

  prefs.putUShort(KEY_TEMP_MIN, tempMin);
  prefs.putUShort(KEY_TEMP_MAX, tempMax);
  prefs.putUChar(KEY_HUM_MIN, humMin);
  prefs.putUChar(KEY_HUM_MAX, humMax);
  prefs.putUShort(KEY_SOIL_THR, soilThreshold);
  prefs.putUChar(KEY_CMP_MODE, compareMode);
  prefs.putUChar(KEY_PUMP_SPEED, pumpSpeed);
  prefs.putUChar(KEY_WATER_DIR, waterDirection);

  prefs.end();
  Serial.println("[NVS] 设置已保存到闪存");
}

/* ===================== 传感器读取 ===================== */

void readSensors() {
  // 读取 DHT11 温湿度
  float t = dht.readTemperature();
  float h = dht.readHumidity();

  // 校验数据有效性
  if (isnan(t) || isnan(h)) {
    Serial.println("[传感器] ⚠ DHT11 读取失败，保持上次有效值");
    return;
  }

  currentTemp = (uint16_t)(t * 10.0);  // 温度 ×10 存储，保留 1 位小数精度
  currentHum = (uint8_t)h;

  // 读取土壤湿度 ADC
  currentSoil = analogRead(SOIL_ADC_PIN);

  printSensorData();
}

void printSensorData() {
  Serial.print("[传感器] ");
  Serial.printf("土壤 ADC=%d / 4095  |  温度=%.1f°C  |  湿度=%d%%\n",
                currentSoil, currentTemp / 10.0, currentHum);
}

/* ===================== 串口通信实现 ===================== */



void sendSerialFrame(uint8_t type, uint8_t *data, uint8_t len) {
  Serial.write(SERIAL_FRAME_HEAD1);
  Serial.write(SERIAL_FRAME_HEAD2);
  Serial.write(type);
  Serial.write(len);
  Serial.write(data, len);
  uint8_t xorVal = SERIAL_FRAME_HEAD1 ^ SERIAL_FRAME_HEAD2 ^ type ^ len;
  for (uint8_t i = 0; i < len; i++) xorVal ^= data[i];
  Serial.write(xorVal);
}

// 通过串口发送传感器数据（6 字节）
void sendSensorDataSerial() {
  uint8_t buffer[6];
  serializeSensorData(buffer);
  sendSerialFrame(SERIAL_TYPE_SENSOR, buffer, 6);
}

// 通过串口发送设置数据（11 字节）
void sendSettingsSerial() {
  uint8_t buffer[11];
  serializeSettings(buffer);
  sendSerialFrame(SERIAL_TYPE_SETTINGS, buffer, 11);
}

// 通过串口发送设备信息（JSON 格式，包含 MAC、芯片型号等）
void sendDeviceInfoSerial() {
  String info = buildDeviceInfoJson();
  sendSerialFrame(SERIAL_TYPE_DEVICE_INFO, (uint8_t *)info.c_str(), info.length());
}

// 构建设备信息 JSON 字符串
// 包含：固件版本、MAC 地址、芯片型号、芯片修订版、Flash 大小、空闲堆内存
String buildDeviceInfoJson() {
  uint64_t mac = ESP.getEfuseMac();
  char macStr[18];
  snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
           (uint8_t)(mac >> 40), (uint8_t)(mac >> 32),
           (uint8_t)(mac >> 24), (uint8_t)(mac >> 16),
           (uint8_t)(mac >> 8), (uint8_t)(mac));

  String json = "{";
  json += "\"fw\":\"";
  json += FIRMWARE_VERSION;
  json += "\"";
  json += ",\"mac\":\"";
  json += macStr;
  json += "\"";
  json += ",\"chip\":\"";
  json += ESP.getChipModel();
  json += "\"";
  json += ",\"rev\":";
  json += ESP.getChipRevision();
  json += ",\"flash\":";
  json += ESP.getFlashChipSize() / 1024;
  json += ",\"heap\":";
  json += ESP.getFreeHeap();
  json += "}";
  return json;
}

// 处理串口接收到的命令帧
void handleSerialCommand() {
  static uint8_t rxBuffer[64];
  static uint8_t rxIndex = 0;

  while (Serial.available()) {
    uint8_t b = Serial.read();

    // 查找帧头
    if (rxIndex == 0 && b != SERIAL_FRAME_HEAD1) continue;
    if (rxIndex == 1 && b != SERIAL_FRAME_HEAD2) {
      rxIndex = 0;
      continue;
    }

    rxBuffer[rxIndex++] = b;

    // 至少收到 4 字节才能判断长度
    if (rxIndex >= 4) {
      uint8_t payloadLen = rxBuffer[3];
      uint8_t totalLen = 4 + payloadLen + 1;  // 帧头(2) + 类型(1) + 长度(1) + 数据 + 校验(1)

      if (rxIndex >= totalLen) {
        // 验证 XOR 校验
        uint8_t xorReceived = rxBuffer[totalLen - 1];
        uint8_t xorCalculated = 0;
        for (uint8_t j = 0; j < totalLen - 1; j++) xorCalculated ^= rxBuffer[j];

        if (xorReceived == xorCalculated) {
          uint8_t type = rxBuffer[2];
          uint8_t *payload = &rxBuffer[4];

          switch (type) {
            case SERIAL_TYPE_SETTINGS:
              {
                // 收到设置写入帧（11 字节）
                if (payloadLen == 11) {
                  uint8_t newSpeed = payload[9];
                  uint8_t newDir = payload[10];

                  // 保存旧值，用于水泵控制决策
                  uint8_t prevPumpSpeed = pumpSpeed;
                  uint8_t prevWaterDir = waterDirection;

                  deserializeSettings(payload);

